content/ml_introduction.org
:PROPERTIES:
:ID:       ec1b20f4-c0d1-4651-b2d8-0ff5a1956c25
:END:
#+title: ml_introduction
#+filetags: :moc: 
#+hugo_base_dir: /home/phihungnguyen/quartz 
#+hugo_section: machine_learning
#+date: [2024-02-29 Thu]
#+hugo_lastmod: [2024-02-29 Thu]
#+hugo_tags: noexport
*Link*:  

* Types of Learning

** Supervised (Inductive) learning

- This study is done when the training data and desired outputs (labels) are given

- There are a few algorithms in supervised learning:


1) Regression
   Given a set of $$ (x_i,y_i)$$, we use the set to train the function $$ f(x)$$ to
   predict y given any value of x.
2) Classification
   We still train like regression with a different model. In this model, the outputs
   y are classified (like 0 or 1).
** Unsuperivsed Learning

- We are only given the data to train without the desired outputs

- Given x which can have dimension d, each dimention is an attribute.

- The study of the output will give us some hidden structure of x's
** Semi-supervised learning

- Similar to supervised learning, but only a few desired outputs are given


** Reinforcement learning

- We give rewards for the actions done


